{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "The best chest exercises are not determined by the ones you can lift the most weight on but rather the ones that work best for you.  In this video, I’m going to show you the 8 best chest exercises to help you build a bigger chest despite using bench press and dips for years.  Many people think that these staple chest workout moves must be included if you want to develop a big chest, but the reality is they do not work best for everyone.

That said, the eight chest exercises shown here are ones you can try if you feel like you have hit a dead end in your chest development.  Beyond that, these can be done as activators before your chest workout that will help you to get even more out of the bench press and dips later in the routine.  The key is first to understand why these two big exercises may not be working so great for you.

It comes down to the anatomy of the chest and how it prefers to contract.  The biggest motion that the pecs are responsible for above all others is horizontal adduction at the shoulder.  This means, taking the upper arm and driving it across the chest.  Ideally, you would want your chest exercises to incorporate the motion so that both arms could almost cross over each other or at least the midline of your body if you want to get a maximal chest contraction.

We can do that with the first exercise shown, the twisting pushup.  Here, no equipment at all is needed to help you get more from your pushups.  Instead of just pushing straight up and down you can twist your body as you do and get a relative adduction at the shoulder which will help you get a better squeeze and contraction.  Since your hands will be fixed on the ground as they are in a regular pushup, the twisting of the body will draw the arm across and help you get better results from doing this.

The plate squeeze is an awesome chest exercise that can be used as an activator before your chest workout or at the end as a finisher.  The key is to squeeze the plates as hard as possible together and not let them slide apart.  The chest contraction you feel here will be insane and well worth the inclusion of this move in your chest workout.

The Db chest pullover is a variation of the classic dumbbell pullover, except this one will target the upper pecs as opposed to the lats.  Instead of flaring the elbows and trying to pull the weight all the way up over your chest, restrict the range of motion a bit and squeeze the hands together to get the weight up.  This will light up your upper pecs and really help you to recruit this often hard to hit area much better.

Floor flys give you a safer way to overload this common chest exercise.  The problem with the traditional fly exercise is that it places your shoulder joints in a compromising position.  Some will say to just drop the amount of weight you use here and you will have no problems.  The issue is, you will be leaving gains on the table by doing that.  Here you can get the best of all worlds while having the floor to support your use of heavier, muscle building weights.

The variations of chest crossovers give you an obvious way to get not just one arm, but both, across your body and experience a strong chest contraction.  Whether you do the 3D cross over or the X cross, both of these are going to help you to get great chest activation and even better chest growth over time.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%208%20Best%20Chest%20Exercises%20(NO%20BENCH%20OR%20DIPS!).mp4?alt=media&token=547973ae-9230-4f01-934d-c4aa42178b7a" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/BigBuckBunny.jpg",
      "title" : "The 8 Best Chest Exercises (No bench or dips!)"
    }, {
      "description" : "The first Blender Open Movie from 2006",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ElephantsDream.mp4" ],
      "subtitle" : "By Blender Foundation",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/ElephantsDream.jpg",
      "title" : "Elephant Dream"
    }, {
      "description" : "HBO GO now works with Chromecast -- the easiest way to enjoy online video on your TV. For when you want to settle into your Iron Throne to watch the latest episodes. For $35.\nLearn how to use Chromecast with HBO GO and more at google.com/chromecast.",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ForBiggerBlazes.mp4" ],
      "subtitle" : "By Google",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/ForBiggerBlazes.jpg",
      "title" : "For Bigger Blazes"
    }, {
      "description" : "Introducing Chromecast. The easiest way to enjoy online video and music on your TV—for when Batman's escapes aren't quite big enough. For $35. Learn how to use Chromecast with Google Play Movies and more at google.com/chromecast.",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ForBiggerEscapes.mp4" ],
      "subtitle" : "By Google",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/ForBiggerEscapes.jpg",
      "title" : "For Bigger Escape"
    }, {
      "description" : "Introducing Chromecast. The easiest way to enjoy online video and music on your TV. For $35. Find out more at google.com/chromecast.",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ForBiggerFun.mp4" ],
      "subtitle" : "By Google",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/ForBiggerFun.jpg",
      "title" : "For Bigger Fun"
    }, {
      "description" : "Introducing Chromecast. The easiest way to enjoy online video and music on your TV—for the times that call for bigger joyrides. For $35. Learn how to use Chromecast with YouTube and more at google.com/chromecast.",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ForBiggerJoyrides.mp4" ],
      "subtitle" : "By Google",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/ForBiggerJoyrides.jpg",
      "title" : "For Bigger Joyrides"
    }, {
      "description" : "Introducing Chromecast. The easiest way to enjoy online video and music on your TV—for when you want to make Buster's big meltdowns even bigger. For $35. Learn how to use Chromecast with Netflix and more at google.com/chromecast.",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ForBiggerMeltdowns.mp4" ],
      "subtitle" : "By Google",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/ForBiggerMeltdowns.jpg",
      "title" : "For Bigger Meltdowns"
    }, {
      "description" : "Sintel is an independently produced short film, initiated by the Blender Foundation as a means to further improve and validate the free/open source 3D creation suite Blender. With initial funding provided by 1000s of donations via the internet community, it has again proven to be a viable development model for both open 3D technology as for independent animation film.\nThis 15 minute film has been realized in the studio of the Amsterdam Blender Institute, by an international team of artists and developers. In addition to that, several crucial technical and creative targets have been realized online, by developers and artists and teams all over the world.\nwww.sintel.org",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/Sintel.mp4" ],
      "subtitle" : "By Blender Foundation",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/Sintel.jpg",
      "title" : "Sintel"
    },   {
      "description" : "The Smoking Tire meets up with Chris and Jorge from CarsForAGrand.com to see just how far $1,000 can go when looking for a car.The Smoking Tire meets up with Chris and Jorge from CarsForAGrand.com to see just how far $1,000 can go when looking for a car.",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/WhatCarCanYouGetForAGrand.mp4" ],
      "subtitle" : "By Garage419",
      "thumb" : "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/images/WhatCarCanYouGetForAGrand.jpg",
      "title" : "What care can you get for a grand?"
    } ]
  } ]
}
