{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "The best chest exercises are not determined by the ones you can lift the most weight on but rather the ones that work best for you.  In this video, I’m going to show you the 8 best chest exercises to help you build a bigger chest despite using bench press and dips for years.  Many people think that these staple chest workout moves must be included if you want to develop a big chest, but the reality is they do not work best for everyone.

That said, the eight chest exercises shown here are ones you can try if you feel like you have hit a dead end in your chest development.  Beyond that, these can be done as activators before your chest workout that will help you to get even more out of the bench press and dips later in the routine.  The key is first to understand why these two big exercises may not be working so great for you.

It comes down to the anatomy of the chest and how it prefers to contract.  The biggest motion that the pecs are responsible for above all others is horizontal adduction at the shoulder.  This means, taking the upper arm and driving it across the chest.  Ideally, you would want your chest exercises to incorporate the motion so that both arms could almost cross over each other or at least the midline of your body if you want to get a maximal chest contraction.

We can do that with the first exercise shown, the twisting pushup.  Here, no equipment at all is needed to help you get more from your pushups.  Instead of just pushing straight up and down you can twist your body as you do and get a relative adduction at the shoulder which will help you get a better squeeze and contraction.  Since your hands will be fixed on the ground as they are in a regular pushup, the twisting of the body will draw the arm across and help you get better results from doing this.

The plate squeeze is an awesome chest exercise that can be used as an activator before your chest workout or at the end as a finisher.  The key is to squeeze the plates as hard as possible together and not let them slide apart.  The chest contraction you feel here will be insane and well worth the inclusion of this move in your chest workout.

The Db chest pullover is a variation of the classic dumbbell pullover, except this one will target the upper pecs as opposed to the lats.  Instead of flaring the elbows and trying to pull the weight all the way up over your chest, restrict the range of motion a bit and squeeze the hands together to get the weight up.  This will light up your upper pecs and really help you to recruit this often hard to hit area much better.

Floor flys give you a safer way to overload this common chest exercise.  The problem with the traditional fly exercise is that it places your shoulder joints in a compromising position.  Some will say to just drop the amount of weight you use here and you will have no problems.  The issue is, you will be leaving gains on the table by doing that.  Here you can get the best of all worlds while having the floor to support your use of heavier, muscle building weights.

The variations of chest crossovers give you an obvious way to get not just one arm, but both, across your body and experience a strong chest contraction.  Whether you do the 3D cross over or the X cross, both of these are going to help you to get great chest activation and even better chest growth over time.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%208%20Best%20Chest%20Exercises%20(NO%20BENCH%20OR%20DIPS!).mp4?alt=media&token=547973ae-9230-4f01-934d-c4aa42178b7a" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2Fthumbnailchest.jpg?alt=media&token=fa6a4f50-ba67-417f-9374-ced7fcfef6cf",
      "title" : "The 8 Best Chest Exercises (No bench or dips!)"
    }, {
      "description" : "The perfect back workout should consist of exercises for not just the lats and traps but other important muscles of the back as well.  That said, even that doesn’t make the back workout complete.  In order to round out your back with a well rounded workout you need to fill in the gaps of what is lacking on those popular back exercises and put science back in your training.  That is what we do in this video.

The problem with lat focused training isn’t just that it trains simply a fraction of what the back muscles are capable of but also that many people choose repetitive exercises that work the back in the same plane.  For instance, if you look at the pullup and lat pulldown you will see two major vertical pulling exercises that while not bad to perform in the same back workout, overlook the importance of horizontal pulling if nothing else is done.

It goes beyond this however.  Even when you perform the pullup, many will look at it as a high rep bodyweight exercise only.  They overlook how powerful the movement can be when loaded up with additional weight as in a weighted chin up.  This can become a tremendous compound exercise option and one that is capable of building a lot of back strength, size and overall gains.  Additionally, getting locked in on one grip during this exercise is costing you the chance to work other areas of the back such as the teres major (which in and of itself occupies a large amount of mass above the lats) and therefore limiting the gains you will see from your workout.

Instead, you will want to be sure to mix up chins and pullups along with a foundational strength exercise for the back like the deadlift to start your workout off right.  The deadlift has the ability to work many of the areas of the back all in one shot.  The traps, lats, and lower back all get a heavy dose of overload on this powerhouse of a back exercise.  If you load it heavy enough and refuse to sacrifice your form, this can be an enormous benefit to your overall back development.

We also have an opportunity to introduce some straight arm pushdowns with each warmup set of deadlifts.  This helps to ingrain one of the most important movement patterns you will need to not only perform the deadlift but all next level back exercises.  

As you make your way through the workout however you also don’t want to miss the chance to train explosively.  When you train like an athlete you always want to speed up what you slow down with your heavier weight training. The barbell dead row is a perfect example of this.  Perform this powerful back exercise as a follow up to the deadlift and you will find that even a heavier weight seems lighter and more able to be accelerated.

No perfect back workout would be complete without some additional focused tension towards the lats.  This allows you to develop that mind muscle connection that is important for maximizing hypertrophy of the back.  Choose between one of the two exercises listed and only do one of them.  Just focus on really squeezing each rep and taking the lats through their full range of motion for optimum effect.

Finally, a perfect back workout will not forget the importance of corrective exercises for the back.  Here we want to be sure we work both the lumbar erectors and rotator cuff.  We can do both in one move using the Hyper Y/W combo shown in the video.  You will not need to use heavy weights to do this.  Light weights will still light you up in exactly the way you need to be for best effect.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20PERFECT%20Back%20Workout%20(Sets%20and%20Reps%20Included).mp4?alt=media&token=a8ba4c1f-fe40-4a5c-bf35-7ed3f7a94355" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2Fthumbnailback.jpg?alt=media&token=1691daf9-1619-45dc-a823-f65035f1a588",
      "title" : "The PERFECT Back Workout (Sets and Reps Included)"
    }, {
      "description" : "The key to any arm workout is intensity.  There is no better way to ensure the intensity of a workout than to take the normal volume you would do and condense it into a much shorter period of time.  In this video, I show you an arm workout with just 4 biceps and triceps exercises that you can complete in 8 minutes or less that will spark all kinds of arm gains.

The setup for the workout is easy.  All you need is a single pair of dumbbells, a bench that you can adjust to an incline and a pullup bar.  You want to start with just two arm exercises, the hands out incline curl for your biceps and the incline dumbbell triceps extensions for the muscles on the other side of your arm.  Choose a weight that you can perform 12 reps to failure on in your weaker of the two exercises.  In this case it is the triceps extension for me.

Start by performing a set of the hands out incline curls to failure.  As soon as you cannot complete another rep lift the dumbbells up overhead and go right into your overhead triceps extensions.  Here again, you will want to go until you cannot perform another quality rep and your triceps are fatigued.  Back again to the incline curl where you want to perform as many reps as you can to failure.  You keep bouncing back and forth between these two arm exercises until you can’t complete any more meaningful reps.

This will happen rather fast because as you fatigue in one arm muscle group you will have a shorter rest time before having to complete reps for the other muscle.  By virtue of this short rest time you will eventually fail out in both exercises.  At this point however, you are only half way through your workout.  This occurred in just 4 minutes for me.

Move on immediately to the next pair of exercises in this 8 minute arm workout.  Here you want to do a bicep chin curl hold.  The goal here is to squeeze your biceps as hard as you can to maintain your position on the bar.  Even as you fatigue you want to keep trying to contract your arms as hard as you can and fight the drop.  Once you cannot hold it anymore, go right to the floor and crank out reps of the cobra pushup.

You want to concentrate on squeezing the triceps hard at the top of every pushup.  The benefit to this triceps exercise over others is that you finish with your arm in extension behind your body so you are actively contracting the long head of the triceps as well.  Rep out and get back up on the bar again.  Keep alternating these biceps and triceps exercises until you once again cannot perform any more meaningful reps of either exercise.
",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2F8%20Minute%20Arm%20Workout%20(SHOCK%20YOUR%20ARMS!).mp4?alt=media&token=7b8f8ea7-dff0-44ed-ac8b-be746b585fda" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2Fthumbnailarm.jpg?alt=media&token=c4aacbba-f89e-43df-a9df-0948b92e8498",
      "title" : "8 Minute Arm Workout"
    }, {
      "description" : "The perfect biceps workout should consist of exercises that not only hit the long and short head but also the brachialis, a totally separate muscle. In addition, it must put the biceps through its full range of motion and utilize both the flexion of the elbow and the supination of the hand. That said, even that won’t complete your biceps workout! In order to round out your biceps you need to also include techniques that create unique stresses on the muscle giving it no choice but respond. That is what we do in this video.

If you look at the main exercises that people do in their biceps workouts you will see a lot of curls. After all, a major function of the biceps is to flex the elbow. 

This is a problem when it comes to complete biceps development your biceps likely get plenty of activation during your back workout so in order to take your development to another level you need to include unique methods of stimulation. Just because you are going through a full range of motion on the exercises that you are doing and performing the major roles of the muscle 9elbow flexion and hand supination) it does not mean that you are giving the muscle sufficient stimulus to force growth. We all know guys who can do tons of pull ups and heavy rows but don’t have the greatest bicep development. 

The solution to this problem is to not forego the popular mass building exercises, those are still the foundation of our training, but we also need to add specialization exercises and techniques. With that said, here what the perfect biceps workout would look like:

Cheat Curls - To Failure immediately into
Barbell Drag Curl - To Failure

Perform for 3 Sets

Weighted Chins -  To Failure immediately into
Pulsed Contraction Chin Curls - To Failure

Perform for 3 Sets

Incline Dumbbell Curls - 3 sets to failure (Utilize the stretch reflex of the triceps technique)

Dumbbell Curl Trifecta -  2 sets of 8 on each arm for each exercise
 – Cross supination (Emphasizes the long head of the biceps)
 – Cross pronation (Emphasizes the brachialis )
 – No Money curls (Emphasizes the short head of the biceps)

When you put this together in as I’m suggesting here, you not only now hit the biceps through it’s full range of motion but you hit every area of the biceps as well and in a fashion they’re not likely grown accustom to. Advanced techniques allows for a more intense sets which are obviously more taxing pair that with the difficult compound lifts and you have an excellent workout.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20PERFECT%20Biceps%20Workout%20(Sets%20and%20Reps%20Included).mp4?alt=media&token=99edc726-a077-499c-8f4a-03cd5fbc6db5" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2Fthumbnailarm1.jpg?alt=media&token=b6260a94-2e35-4c3b-a62f-0fe234187c81",
      "title" : "The PERFECT Biceps Workout"
    }, {
      "description" : "If you want to learn how to get bigger shoulders fast then you’ve come to the right place. In this video, you will see how to build big shoulders by doing the opposite of what you likely have been doing up to now. It is going to require that you use slightly heavier weights and focus more on the quality of the contractions of the shoulder muscles on every rep rather than only pressing heavy weights and overdeveloping patterns that are already holding back your gains.

The lack of shoulder growth can be blamed on two things, and it isn’t your mom and dad.  It is the over reliance on just heavy and light dumbbells for shoulders and not training the rear delt enough.

Let’s start with the rear delts, or the lack of training them to be exact. Extension of the shoulder is actually one of the most overlooked components of a fully trained shoulder muscle. The rear head of the shoulders has the ability to extend the shoulder and can handle fairly heavy weight in the process.  The issue however is that you don’t want to just extend the shoulder but also incorporate abduction to hit the middle delt head as well.

The best way to do this is with something called a hip hugger. This starts with dragging the dumbbells up your side as you move your shoulders back behind your body. The elbows then drift away from the sides as you come up to light up the middle delt as well. The key to performing this correctly is making sure that you cannot see your elbows in front of your body if you look to the side. They should be out of view the entire time in order to prevent turning this into a modified upright row.

To make sure you grow bigger shoulders fast you are going to need to increase the weight you are used to a little bit on this shoulder exercise. The rear delts with help of the middle delts can handle slightly heavier loads and should therefore be pushed by using them. You’ll find that you can likely lift more than you can on a lateral raise but less than what you would use on an overhead dumbbell press.

If you get this right, the shoulders and rear delts will be doing all of the lifting. No momentum. What this does is it also keeps the dumbbells very close to the body. While this is not a drag, the closeness of the dumbbells to the body are going to allow you to use slightly heavier weights. Specifically this is going to hit the middle and rear heads of the delts a lot better. When you are struggling to build big shoulders fast, the rear head is often last to grow. 

The front delt doesn’t have to go unworked however.

The second thing you can do is hit the front delts immediately following the conclusion of a set of the hip huggers by doing something called the scoop press. Here, the weights you used on the first shoulder exercise will be perfect to crank out a few reps of the overhead press variation. Lock the elbows into a ninety degree position and drive the upward thrust of the arms with the front deltoids alone.

This works as the perfect drop set and compliments the work already done on the middle and rear delt exercise to make sure you leave no head of the delts unworked.

When you learn how to train the rear delts effectively you will likely fall in love with working them. Many people skip them all together in their shoulder workouts for mass because they just can’t seem to get the exercises to work for them. Now that you can feel them, you can start regularly incorporating these into your workout for bigger shoulders.

If you want to build bigger shoulders fast you sometimes have to be willing to take a step backwards to take giant steps forward. 

These two exercises are something you can include into your very next shoulder workout that are going to start to deliver big results to your shoulder training and growth.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FHow%20to%20Get%20Bigger%20Shoulders%20Fast%20(JUST%20DO%20THIS!).mp4?alt=media&token=705e0b09-e4d1-47ce-a49f-d1c3521ea993" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2Fthumbnailshoulder1.jpg?alt=media&token=5253710e-d952-434c-9ca2-af7e380d9113",
      "title" : "How to Get Bigger Shoulders Fast"
    } ]
  } ]
}
